app/controllers/emails_controller.rb

  def create
    @email = Email.create(object: Faker::Movie.title, body: Faker::Movie.quote)
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "The Matrix"], ["body", "Frankly, my dear, I don’t give a damn."], ["created_at", "2020-11-19 10:39:40.607066"], ["updated_at", "2020-11-19 10:39:40.607066"]]

  def update
    @email = Email.find(params[:id])

    if @email.read === true
      @email.update(read: false)
    else
      @email.update(read: true)
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", false], ["updated_at", "2020-11-19 16:54:35.509865"], ["id", 29]]
UPDATE "emails" SET "read" = $1, "updated_at" = $2 WHERE "emails"."id" = $3  [["read", true], ["updated_at", "2020-11-19 16:50:23.528449"], ["id", 21]]