app/views/emails/create.js.erb

INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "The Matrix"], ["body", "Frankly, my dear, I don’t give a damn."], ["created_at", "2020-11-19 10:39:40.607066"], ["updated_at", "2020-11-19 10:39:40.607066"]]
---
document.getElementById("new-mail").insertAdjacentHTML("beforeend", "<%= j render 'email', email: @email %>");